package object;

//-----------------------------------------------------------------------------------------------------------
// class Data01
//-----------------------------------------------------------------------------------------------------------
class Data01 {
	int value;
	// 기본 생성자
	Data01() {
		System.out.println("저는 Data01의 기본 생성자 입니다.");
	} 
} // End - class Data01

//-----------------------------------------------------------------------------------------------------------
// class Data02
//-----------------------------------------------------------------------------------------------------------
class Data02 {
	int value;
	Data02() {
		System.out.println("Data02의 기본 생성자입니다.");
	}
	Data02(int x) { // 매개변수가 있는 생성자. 여러 인스턴스 생성할 경우 각기 다른 값으로 초기화시켜야 할 때 유용하다.
		value = x;
	}
} // End - class Data02

//-----------------------------------------------------------------------------------------------------------
// public class ConstructorExam01
//-----------------------------------------------------------------------------------------------------------
public class ConstructorExam01 {
	//-----------------------------------------------------------------------------------------------------------
	// public static void main(String[] args) 
	//-----------------------------------------------------------------------------------------------------------
	public static void main(String[] args) {
		Data01 d1 	= new Data01() ;   
		//Data02 d2   = new Data02() ; // 기본생성자를 실행

		Data02 d2   = new Data02(100) ; 
		System.out.println(d2.value);
		
	}	// End -  public static void main(String[] args) 

}	// End -  public class ConstructorExam01
